Repository: chabulhwi/tpil-solutions
Catalog: docs/omegat/project_save.tmx
Source language: en
Languages: ko

source: Recently, a high school student from Korea asked two math teachers which of the following is a proposition: (a) a subjective value judgment and (b) a mathematical statement whose truth value we don't know yet.
ko: 최근에 한국의 어느 한 고등학생이 두 수학 교사분에게 (1) 주관적 가치 판단, (2) 진릿값을 아직 모르는 수학 진술 가운데 무엇이 명제인지 질문했습니다.

source: References
ko: 참고 문헌

source: Replace the underscore in each expression listed below with an appropriate type, then check the value of each expression.
ko: 아래에 나열된 식에 있는 밑줄을 각각 적절한 유형으로 바꾼 다음, 그 식의 값을 확인하라.

source: Rule of inference
ko: 추론 규칙

source: Rules of inference
ko: 추론 규칙

source: Show that Bool and Nat are inhabited, that the product of two inhabited types is inhabited, and that the type of functions to an inhabited type is inhabited.
ko: 두 유형 Bool과 Nat에 거주자가 있고, 거주자가 있는 두 유형의 곱에도 거주자가 있으며, 거주자가 있는 유형으로의 함수의 유형에도 거주자가 있음을 보여라.

source: Show that the law of excluded middle can be derived from the principle of double-negation elimination.
ko: 이중 부정 제거 원리에서 배중률을 도출할 수 있음을 보여라.

source: Symbol: ¬ (read as "not")
ko: 기호: ¬ ["낫(not)"이라고 읽음]

source: Symbol: → (read as "implies")
ko: 기호: → ("함의"라고 읽거나 "…이면"이라고 읽음)

source: Symbol: ↔ (read as "if and only if")
ko: 기호: ↔ ("동등" 또는 "쌍조건문"이라고 읽음)

source: Symbol: ∀ (read as "for all")
ko: 기호: ∀ ("모든"이라고 읽음)

source: Symbol: ∃ (read as "exists")
ko: 기호: ∃ ("어떤"이라고 읽거나 "…이 존재한다"라고 읽음)

source: Symbol: ∧ (read as "and")
ko: 기호: ∧ ["앤드(and)"라고 읽거나 "그리고"라고 읽음]

source: Symbol: ∨ (read as "or")
ko: 기호: ∨ ["오어(or)"라고 읽거나 "또는"이라고 읽음]

source: The OmegaT project is in the docs directory.
ko: 오메가T 프로젝트는 docs 디렉터리에 있습니다.

source: The Usages of the Term 'Proposition'
ko: '명제' 용어의 쓰임새

source: The functions f and g shouldn't be definitionally equal.
ko: 두 함수 f와 g가 정의상 같으면 안 된다.

source: The other argued that linguistically speaking ("국어적으로 해석한다면"), we can determine the truth or falsehood of (b), but mathematically speaking, it can't be a proposition.
ko: 다른 분은 (2)를 '국어적으로' 해석한다면 그것의 참과 거짓을 판별할 수 있지만, '수학적으로' 해석한다면 진릿값을 모르는 진술은 명제가 될 수 없다고 주장하셨습니다.

source: The other argued that, linguistically speaking ("국어적으로 해석한다면"), we can determine the truth or falsehood of (b), but mathematically speaking, it can't be a proposition.
ko: 다른 분은 (2)를 '국어적으로' 해석한다면 그것의 참과 거짓을 판별할 수 있지만, '수학적으로' 해석한다면 진릿값을 모르는 진술은 명제가 될 수 없다고 주장하셨습니다.

source: The term ‘proposition’ has a broad use in contemporary philosophy.
ko: 동시대 철학에서 ‘명제’ 용어는 폭넓게 쓰인다.

source: There's an error in the following code.
ko: 다음 코드에 오류가 있다.

source: This directory also contains Lean files providing examples of the concepts discussed in the text.
ko: 교재에서 다룬 개념들의 보기를 드는 린 파일도 여기에 있습니다.

source: This is the repository for my solutions to the exercises in "Theorem Proving in Lean 4" by Jeremy Avigad, Leonardo de Moura, Soonho Kong and Sebastian Ullrich, with contributions from the Lean Community.
ko: 제러미 아비가드 님, 레오나르두 지 모라 님, 공순호 님 그리고 제바스티안 울리히 님이 저술하고, 린 커뮤니티의 기여를 받아 개정된 "린 4로 하는 정리 증명"의 제 연습 문제 풀이가 이 저장소에 들어 있습니다.

source: Truth
ko: 참

source: Truth and Falsity
ko: 참과 거짓

source: Universal Quantifiers
ko: 보편 정량어

source: Use Empty.elim to give an example of a term of the following type.
ko: Empty.elim를 이용해, 다음 유형에 속하는 항의 보기를 들어라.

source: Use Nat.recOn to prove the theorem Nat.zero_add.
ko: Nat.recOn을 이용해 정리 Nat.zero_add를 증명하라.

source: Use Subtype to define the type of odd numbers.
ko: Subtype을 이용해 홀수의 유형을 정의하라.

source: Use the #check command to give the type of each expression listed below.
ko: #check 명령어를 이용해, 아래에 나열된 식의 유형을 각각 구하라.

source: Use the #eval command to give the value of each expression listed below.
ko: #eval 명령어를 이용해, 아래에 나열된 식의 값을 각각 구하라.

source: Use the #print command to check each definition of the following functions:
ko: #print 명령어를 이용해, 다음 함수들의 정의를 확인하라.

source: Use the #print command to check the definitions of the following functions:
ko: #print 명령어를 이용해, 다음 함수들의 정의를 확인하라.

source: Use the def keyword to declare a new constant of each type listed below.
ko: def 핵심어를 이용해, 아래의 유형에 속하는 새로운 상수를 각각 선언하라.

source: Use the print command to check the type of the function List.cons, then answer by true or false each of the following statements about the function.
ko: print 명령어를 이용해 함수 List.cons의 유형을 확인하라. 그런 뒤, 이 함수에 대한 다음 진술이 참인지 거짓인지 각각 판단하라.

source: We don't know whether it's true or false as of 2024, so high school mathematics teachers in South Korea would have to answer no.
ko: 2024년 현재 우리는 아직 이 추측이 참인지 거짓인지 모르니, 한국의 고등학교 수학 교사들은 그렇지 않다고 답할 것입니다.

source: Which of the following functions are alpha-equivalent?
ko: 다음 중 어느 함수들이 알파 동등한가?

source: Why does the definition of foo below type check, but the definition of bar doesn't?
ko: 왜 아래에 나온 foo의 정의는 유형 확인이 잘되지만, bar의 정의는 그렇지 않은가?

source: Yet to be public.
ko: 아직 비공개돼 있습니다.

source: You are free to reuse the content under the terms of Apache License Version 2.0.
ko: 이 저작물은 아파치 라이선스, 버전 2.0의 조건에 따라 재이용할 수 있습니다.

source: You need to install the Okapi filters plugin for OmegaT to make OmegaT parse Markdown files.
ko: 오메가T로 마크다운 파일을 구문 분석 하려면 오메가T를 위한 오카피(Okapi) 필터 플러그인을 설치해야 됩니다.

source: \(a\) At least one of them is parametrically polymorphic.
ko: \(a\) 이 상수들 중 적어도 하나는 매개 변수 다형적이다.

source: \(a\) It is parametrically polymorphic.
ko: \(a\) 이 함수는 매개 변수 다형적이다.

source: \(a\) It is universe-polymorphic.
ko: \(a\) 이 함수는 세계 다형적이다.

source: \(a\) The equality relation is an equivalence relation.
ko: \(a\) 같음 관계는 동치 관계이다.

source: \(a\) The proposition ¬p is definitionally equal to p → False.
ko: \(a\) 명제 ¬p은 p → False와 정의상 같다.

source: \(a\) The term p is a type.
ko: \(a\) 항 p는 유형이다.

source: \(a\) The type p → q is a function type.
ko: \(a\) 유형 p → q는 함수형이다.

source: \(a\) What are the introduction and elimination rules for the Bool type?
ko: \(a\) Bool 유형의 도입 규칙과 제거 규칙은 무엇인가?
